TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробы/гкс_ВнешниеПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВнешниеПробы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПробы</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПробы</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДКомпозитнойПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоИнспекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиКачестваWarehouse</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.гкс_ПродукцияWarehouse</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияНазначения</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элеватор</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробыПоЗаявкамНаПеревозку/гкс_ВнешниеПробыПоЗаявкамНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВнешниеПробыПоЗаявкамНаПеревозку</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВнешняяПроба</name>
    <type>
      <types>DocumentRef.гкс_ВнешняяПроба</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЗерновоза</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользованияКачества</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробыРегистрации/гкс_ВнешниеПробыРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВнешниеПробыРегистрации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <comment>Лабораторный анализ входного контроля</comment>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяПроба</name>
    <type>
      <types>DocumentRef.гкс_ВнешняяПроба</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КонтрольЗаполненияВнешнихПроб/гкс_КонтрольЗаполненияВнешнихПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КонтрольЗаполненияВнешнихПроб</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.гкс_ТипыОбъектовWarehouse</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяПроба</name>
    <type>
      <types>DocumentRef.гкс_ВнешняяПроба</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектWarehouse</name>
    <type>
      <types>DefinedType.гкс_WarehouseСправочники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_УчетВнешнихПроб/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение
// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Не Свойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ВнешниеПробы);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ВнешниеПробыРегистрации);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_КонтрольЗаполненияВнешнихПроб);
	КонецЕсли;
		
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_ВнешниеПробы") 
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробы) Тогда
		
		Движения.гкс_ВнешниеПробы.Записывать = Истина;
		Движения.гкс_ВнешниеПробы.Загрузить(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробы);				
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_ВнешниеПробыПоЗаявкамНаПеревозку")	
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыПоЗаявкамНаПеревозку) Тогда
		
		Движения.гкс_ВнешниеПробыПоЗаявкамНаПеревозку.Записывать = Истина;
		Движения.гкс_ВнешниеПробыПоЗаявкамНаПеревозку.Загрузить(
			ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыПоЗаявкамНаПеревозку);		
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_ВнешниеПробыРегистрации")
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыРегистрации) Тогда
		
		Движения.гкс_ВнешниеПробыРегистрации.Записывать = Истина;
		Движения.гкс_ВнешниеПробыРегистрации.Загрузить(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыРегистрации);				
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_КонтрольЗаполненияВнешнихПроб")	
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_КонтрольЗаполненияВнешнихПроб) Тогда
		
		Движения.гкс_КонтрольЗаполненияВнешнихПроб.Записывать = Истина;
		Движения.гкс_КонтрольЗаполненияВнешнихПроб.Загрузить(
			ТаблицыДляДвижений.Таблицагкс_КонтрольЗаполненияВнешнихПроб);	
	КонецЕсли;
	
КонецПроцедуры

// Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возникает после выполнения записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

// Получает занчения показателей внешней пробы с типом "лот на 1000т"
//
// Параметры:
//	ВнешняяПроба - ДокументСсылка.гкс_ВнешняяПроба - Документ внешней пробы
//
// Возвращаемое значение: 
//		ТаблицаЗначений - таблица значений внешних проб
//
Функция ЗначенияВнешнейПробы(ВнешняяПроба) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВнешняяПробаКачественныеПоказатели.Показатель КАК Показатель,
		|	ВнешняяПробаКачественныеПоказатели.Значение КАК ЗначениеПоказателя
		|ИЗ
		|	Документ.гкс_ВнешняяПроба.КачественныеПоказатели КАК ВнешняяПробаКачественныеПоказатели
		|ГДЕ
		|	ВнешняяПробаКачественныеПоказатели.Ссылка = &Ссылка
		|	И ВнешняяПробаКачественныеПоказатели.ТипВнешнейПробы = ЗНАЧЕНИЕ(Справочник.гкс_ТипыВнешнихПробWarehouse.ЛотНаТысячуТон)
		|	И ВнешняяПробаКачественныеПоказатели.Показатель <> ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка)
		|	И ВнешняяПробаКачественныеПоказатели.Значение <> 0";
	
	Запрос.УстановитьПараметр("Ссылка", ВнешняяПроба);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции	

#КонецОбласти
